#!/usr/bin/env bash
#
# nomeDoScript.sh - Breve descrição
#
# Site:       https://meusite.com.br
# Autor:      Seu nome
# Manutenção: Seu nome ou responsável pela manutenção
#
# ---------------------------------------------------------------------------- #
# Aqui deve utilizar uma descrição mais detalhada sobre o programa,
# explicando a forma de utilizar.
#
# Exemplo:
#     $ ./nomeDoScript.sh -d 1
#     Neste exemplo o script será executado no modo debug nível 1.
# ---------------------------------------------------------------------------- #
# Histórico:
#
#   v1.0 17/10/2025, Autor da mudança
#       - O que mudou ?
#   v1.1 20/10.2025, Autor da mudança
#       - O que mudou ?
# ---------------------------------------------------------------------------- #
# Testado em:
#   bash {versão}
# ---------------------------------------------------------------------------- #
# Agradecimentos:
#
#   Joãozinho - Encontrou um bug na parte de login.
#   Mariazinha - Enviou uma sugestão de adicionar o -h.
# ---------------------------------------------------------------------------- #

# ------------------------------- VARIÁVEIS ---------------------------------- #

# ---------------------------------------------------------------------------- #

# ------------------------------- TESTES ------------------------------------- #

# -----------------------------------------------------------------------------#

# ------------------------------- FUNÇÕES ------------------------------------ #

# ---------------------------------------------------------------------------- #

# ------------------------------- EXECUÇÃO ----------------------------------- #

# ---------------------------------------------------------------------------- #
